app/controllers/notes_controller.rb

INSERT INTO "notes" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ";afjkle"], ["text", ";lkaje"], ["created_at", 2017-04-12 18:06:00 UTC], ["updated_at", 2017-04-12 18:06:00 UTC]]
---
	def create
		@note = Note.new(note_params)

		if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "text" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["text", "this is a note ad"], ["updated_at", 2017-04-13 15:08:25 UTC], ["id", 5]]
---
	def update
		@note = Note.find(params[:id])

		if @note.update(note_params)